andrewparlane/kinetis_test_projects/frdm_k66f_board/screen_test/tests/test2.c
    // display it
    res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_DISPLAY());
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
        return res;
    }

    // write everything to the DL ram and then swap it in
    res = ft81x_graphics_engine_end_display_list(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_end_display_list failed with %u\n", res);
        return res;
    }

    vTaskDelay(3000);

    return FT81X_RESULT_OK;
}

ft81x_result test2_text(FT81X_Handle *handle)
{
    ft81x_result res;

    // ----------------------------------------------------------
    // load our custom font into g RAM
    // ----------------------------------------------------------
    FT81X_Font_Handle font_handle;
    res = ft81x_text_manager_load_custom_font(handle, &blink_font_l2_raw_font_properties, &font_handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_text_manager_load_custom_font failed with %u\n", res);
        return res;
    }

    // ----------------------------------------------------------
    // Build and display the display list
    // ----------------------------------------------------------
    // reset the co-proc to it's default state
    res = ft81x_coproc_cmd_coldstart(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
        return res;
    }

    // clear the screen
    res = ft81x_graphics_engine_write_display_list_snippet(handle, sizeof(clear_dl_snippet), clear_dl_snippet);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
        return res;
    }

    // initialise the custom font
    res = ft81x_text_manager_send_font_init_dl(handle,
                                               &blink_font_l2_raw_font_properties,
                                               &font_handle,
                                               FT81X_BITMAP_FILTER_NEAREST,
                                               FT81X_BITMAP_WRAP_BORDER,
                                               FT81X_BITMAP_WRAP_BORDER);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_text_manager_send_font_init_dl failed with %u\n", res);
        return res;
    }

    // change the colour for the folowwing text
    res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_COLOUR_RGB(255, 0, 0));
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
        return res;
    }

    // show some text
    res = ft81x_coproc_cmd_text(handle, 10, 30, 31, 0, "Test 2");
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_text failed with %u\n", res);
        return res;
    }

    // show some numbers
    res = ft81x_coproc_cmd_number(handle, 10, 100, 31, 0, (int32_t)0xFFFFFFFF);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_text failed with %u\n", res);
        return res;
    }

    res = ft81x_coproc_cmd_number(handle, 10, 150, 26, FT81X_COPROC_OPTION_SIGNED, (int32_t)0xFFFFFFFF);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_text failed with %u\n", res);
        return res;
    }

    // custom font text (note I replaced the data for ~ with a smiley)
    res = ft81x_coproc_cmd_text(handle, 10, 180, font_handle.font_id, 0, "Custom Font -> ~");
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_text failed with %u\n", res);
        return res;
    }

    // numbers with custom font
    res = ft81x_coproc_cmd_number(handle, 10, 210, font_handle.font_id, 0, -1);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_text failed with %u\n", res);
        return res;
    }

    res = ft81x_coproc_cmd_number(handle, 10, 240, font_handle.font_id, FT81X_COPROC_OPTION_SIGNED, -1);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_text failed with %u\n", res);
        return res;
    }

    res = ft81x_coproc_cmd_number(handle, 10, 270, font_handle.font_id, 0, 1337);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_text failed with %u\n", res);
        return res;
    }

    // display it
    res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_DISPLAY());
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
        return res;
    }

    // write everything to the DL ram and then swap it in
    res = ft81x_graphics_engine_end_display_list(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_end_display_list failed with %u\n", res);
        return res;
    }

    vTaskDelay(3000);

    return FT81X_RESULT_OK;
}

ft81x_result test2_buttons(FT81X_Handle *handle)
{
    ft81x_result res;

    // reset the co-proc to it's default state
    res = ft81x_coproc_cmd_coldstart(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
        return res;
    }

    // clear the screen
    res = ft81x_graphics_engine_write_display_list_snippet(handle, sizeof(clear_dl_snippet), clear_dl_snippet);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
        return res;
    }

    // draw a default button
    res = ft81x_coproc_cmd_button(handle, 10, 10, 200, 100, 24, 0, "button1");
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_button failed with %u\n", res);
        return res;
    }

    // change the fg colour to red
    res = ft81x_coproc_cmd_fgcolour(handle, 255, 0, 0);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_fgcolour failed with %u\n", res);
        return res;
    }

