andrewparlane/kinetis_test_projects/frdm_k66f_board/screen_test/tests/test2.c
    // display it
    res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_DISPLAY());
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
        return res;
    }

    // write everything to the DL ram and then swap it in
    res = ft81x_graphics_engine_end_display_list(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_end_display_list failed with %u\n", res);
        return res;
    }

    vTaskDelay(3000);

    return FT81X_RESULT_OK;
}

ft81x_result test2_gradient(FT81X_Handle *handle)
{
    ft81x_result res;

    // reset the co-proc to it's default state
    res = ft81x_coproc_cmd_coldstart(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
        return res;
    }

    // clear the screen
    res = ft81x_graphics_engine_write_display_list_snippet(handle, sizeof(clear_dl_snippet), clear_dl_snippet);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
        return res;
    }

    // show a gradient
    res = ft81x_coproc_cmd_gradient(handle, 200, 100, 255, 0, 0, 300, 400, 0, 0, 255);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_coproc_cmd_gradient failed with %u\n", res);
        return res;
    }

#warning TODO: add support for scissor commands then improve test2_gradient()

    // display it
    res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_DISPLAY());
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
        return res;
    }

    // write everything to the DL ram and then swap it in
    res = ft81x_graphics_engine_end_display_list(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("ft81x_graphics_engine_end_display_list failed with %u\n", res);
        return res;
    }

    vTaskDelay(3000);

    return FT81X_RESULT_OK;
}

ft81x_result test2_progress_scrollbars_sliders(FT81X_Handle *handle)
{
    ft81x_result res;

    for (int i = 0; i <= 100; i++)
    {
        // reset the co-proc to it's default state
        res = ft81x_coproc_cmd_coldstart(handle);
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
            return res;
        }

        // clear the screen
        res = ft81x_graphics_engine_write_display_list_snippet(handle, sizeof(clear_dl_snippet), clear_dl_snippet);
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_graphics_engine_write_display_list_snippet failed with %u\n", res);
            return res;
        }

        // show a progress bar
        res = ft81x_coproc_cmd_progress(handle, 50, 50, 220, 30, 0, i, 100);
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_coproc_cmd_progress failed with %u\n", res);
            return res;
        }

        // show a horizontal scrollbar
        res = ft81x_coproc_cmd_scrollbar(handle, 0, 460, 320, 20, 0, i, 10, 110);
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_coproc_cmd_scrollbar failed with %u\n", res);
            return res;
        }

        // show a vertical scrollbar
        res = ft81x_coproc_cmd_scrollbar(handle, 300, 0, 20, 480, 0, i, 30, 130);
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_coproc_cmd_scrollbar failed with %u\n", res);
            return res;
        }

        // show a slider
        res = ft81x_coproc_cmd_slider(handle, 50, 150, 100, 40, 0, i, 100);
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_coproc_cmd_slider failed with %u\n", res);
            return res;
        }

        // show the current value of i
        res = ft81x_coproc_cmd_number(handle, 100, 300, 31, FT81X_COPROC_OPTION_RIGHTX, i);
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_coproc_cmd_text failed with %u\n", res);
            return res;
        }

        // display it
        res = ft81x_graphics_engine_write_display_list_cmd(handle, FT81X_DL_CMD_DISPLAY());
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_graphics_engine_write_display_list_cmd failed with %u\n", res);
            return res;
        }

        // write everything to the DL ram and then swap it in
        res = ft81x_graphics_engine_end_display_list(handle);
        if (res != FT81X_RESULT_OK)
        {
            DbgConsole_Printf("ft81x_graphics_engine_end_display_list failed with %u\n", res);
            return res;
        }

        vTaskDelay(100);
    }
    vTaskDelay(3000);

    return FT81X_RESULT_OK;
}

ft81x_result test2(FT81X_Handle *handle)
{
    ft81x_result res;

    // ----------------------------------------------------------
    // Display some text
    // ----------------------------------------------------------
    res = test2_text(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("test2_text failed with %u\n", res);
        return res;
    }

    // ----------------------------------------------------------
    // Display the FTDI logo animation
    // ----------------------------------------------------------
    res = test2_logo(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("test2_logo failed with %u\n", res);
        return res;
    }

    // ----------------------------------------------------------
    // Display some compressed images
    // ----------------------------------------------------------
    res = test2_compressed_images(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("test2_compressed_images failed with %u\n", res);
        return res;
    }

    // ----------------------------------------------------------
    // Display some buttons
    // ----------------------------------------------------------
    res = test2_buttons(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("test2_buttons failed with %u\n", res);
        return res;
    }

    // ----------------------------------------------------------
    // Display some clocks and guages
    // ----------------------------------------------------------
    res = test2_clocks_and_guages(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("test2_clocks_and_guages failed with %u\n", res);
        return res;
    }

    // ----------------------------------------------------------
    // Display some keys, dials and toggles
    // ----------------------------------------------------------
    res = test2_keys_dials_toggles(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("test2_keys_dials_toggles failed with %u\n", res);
        return res;
    }

    // ----------------------------------------------------------
    // Display a gradient
    // ----------------------------------------------------------
    res = test2_gradient(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("test2_gradient failed with %u\n", res);
        return res;
    }

    // ----------------------------------------------------------
    // Display a progress bar, some scrollbars and sliders
    // ----------------------------------------------------------
    res = test2_progress_scrollbars_sliders(handle);
    if (res != FT81X_RESULT_OK)
    {
        DbgConsole_Printf("test2_progress_scrollbars_sliders failed with %u\n", res);
        return res;
    }

    return FT81X_RESULT_OK;
}
